<a href="https://colab.research.google.com/github/bmukhammadaliev/Database-Management-and-Practice/blob/main/Week7%20activity.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from sqlalchemy import create_engine
my_conn = create_engine("sqlite:////content/my_db.db")

In [2]:
r_set=my_conn.execute('''select name from sqlite_master where type = 'table' ''')
for row in r_set:
  print(row)

('category',)
('subcategory',)
('student',)

In [7]:
q="SELECT id, name, class, mark, sex FROM student WHERE class='Four'"
my_cursor=my_conn.execute(q)
for row in my_cursor:
  print(row)

(1, 'John Deo', 'Four', 75, 'female')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(10, 'Big John', 'Four', 55, 'female')
(15, 'Tade Row', 'Four', 88, 'male')
(16, 'Gimmy', 'Four', 88, 'male')
(21, 'Babby John', 'Four', 69, 'female')
(31, 'Marry Toeey', 'Four', 88, 'male')

In [9]:
# select record based on Id
q="SELECT id, name, class, mark, sex FROM student WHERE id=8 " 
my_cursor=my_conn.execute(q) 
data_row=my_cursor.fetchone()
#print (type (data_row))
print(data_row[0],data_row[1],data_row[3])

8 Asruid 85

In [10]:
# Show 10 records only
q="SELECT id, name, class, mark, sex FROM student limit 0,10 " 
my_cursor=my_conn.execute(q) 
data_row=my_cursor.fetchall() 
print(type(data_row))
print("No of records : ",len (data_row))
for row in data_row:
  print(row)

<class 'list'>
No of records :  10
(1, 'John Deo', 'Four', 75, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(7, 'My John Rob', 'Five', 78, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 55, 'female')

ERROR:sqlalchemy.pool.impl.NullPool:Exception during reset or similar
Traceback (most recent call last):
  File "/usr/local/lib/python3.7/dist-packages/sqlalchemy/pool/base.py", line 753, in _finalize_fairy
    fairy._reset(pool)
  File "/usr/local/lib/python3.7/dist-packages/sqlalchemy/pool/base.py", line 1004, in _reset
    pool._dialect.do_rollback(self)
  File "/usr/local/lib/python3.7/dist-packages/sqlalchemy/engine/default.py", line 683, in do_rollback
    dbapi_connection.rollback()
sqlite3.ProgrammingError: SQLite objects created in a thread can only be used in that same thread. The object was created in thread id 139842282018688 and this is thread id 139841859487488.
ERROR:sqlalchemy.pool.impl.NullPool:Exception closing connection <sqlite3.Connection object at 0x7f2f769d88f0>
Traceback (most recent call last):
  File "/usr/local/lib/python3.7/dist-packages/sqlalchemy/pool/base.py", line 753, in _finalize_fairy
    fairy._reset(pool)
  File "/usr/local/lib/python3.7/dist-packages/sqlalchemy/pool/base.py", line 1004, in _reset
    pool._dialect.do_rollback(self)
  File "/usr/local/lib/python3.7/dist-packages/sqlalchemy/engine/default.py", line 683, in do_rollback
    dbapi_connection.rollback()
sqlite3.ProgrammingError: SQLite objects created in a thread can only be used in that same thread. The object was created in thread id 139842282018688 and this is thread id 139841859487488.

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "/usr/local/lib/python3.7/dist-packages/sqlalchemy/pool/base.py", line 255, in _close_connection
    self._dialect.do_terminate(connection)
  File "/usr/local/lib/python3.7/dist-packages/sqlalchemy/engine/default.py", line 689, in do_terminate
    self.do_close(dbapi_connection)
  File "/usr/local/lib/python3.7/dist-packages/sqlalchemy/engine/default.py", line 692, in do_close
    dbapi_connection.close()
sqlite3.ProgrammingError: SQLite objects created in a thread can only be used in that same thread. The object was created in thread id 139842282018688 and this is thread id 139841859487488.

In [11]:
# Delete sample table student
from sqlalchemy.exc import SQLAlchemyError 
try:
  my_conn.execute('''DROP table student;''') 
  print ("student table deleted")
except SQLAlchemyError as e:
  #print(e)
  error = str(e.__dict__ ['orig'])
  print(error)

student table deleted

In [13]:
# creating student table
from sqlalchemy.exc import SQLAlchemyError 
try:
  my_conn.execute('''
  CREATE TABLE IF NOT EXISTS student(id integer primary key,
                name text,
                class text,
                mark integer,
                sex text
                );''')

  print("Student Table created successfully")
except SQLAlchemyError as e:
  #print(e)
  error = str(e.__dict__ ['orig'])
  print(error)

Student Table created successfully

In [15]:
# add records to student table
r_set=my_conn.execute(''' INSERT INTO 'student' 
('id','name','class','mark','sex') VALUES
(1, 'John Deo','Four',75,'female'),
(2, 'Max Ruin','Three',85,'male'),
(3, 'Arnold','Three',55,'male'),
(4, 'Krish Star','Four',60,'female'),
(5, 'John Mike','Four',60,'female'),
(6, 'Alex John','Four',55,'male'),
(7, 'My John Rob','Five',78,'male'), 
(8, 'Asruid','Five',85,'male'), 
(9, 'Tes Qry','Six',78,'male'), 
(10, 'Big John','Four',55,'female'),
(11, 'Ronald','Six',89,'female'),
(27, 'Big Nose','Three',81,'female'),
(28, 'Roii Base','Seven',86,'female'),
(29, 'Tess Played','Seven',55,'male'),
(30, 'Reppy Red','Six',79,'female'),
(31, 'Marry Toeey','Four',88,'male'),
(32, 'Binn Rott','Seven',90,'female'),
(33, 'Kenn Rein','Six',96,'female'),
(34, 'Gain Toe','Seven',69,'male'),
(35, 'Rows Noump','Six',88,'female');''')